---
kind: method
id: M:Autodesk.Revit.DB.Lighting.SpotLightDistribution.#ctor(Autodesk.Revit.DB.Lighting.SpotLightDistribution)
source: html/73d576ac-386c-e76b-3048-bd29b2010424.htm
---
# Autodesk.Revit.DB.Lighting.SpotLightDistribution.#ctor Method

Creates a copy of the given spotlight distribution

## Syntax (C#)
```csharp
public SpotLightDistribution(
	SpotLightDistribution other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.SpotLightDistribution`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null